id: password-spray-from-single-ip
name: Password Spray from Single IP
description: Detects possible password spray where one IP targets many accounts.
severity: Medium
status: enabled
tactics: ["credential-access","initial-access"]
relevantTechniques: ["T1110.003"]
query: |
SigninLogs
| where ResultType != 0
| summarize UsersTargeted = dcount(UserPrincipalName) by IPAddress
| where UsersTargeted > 5
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: GreaterThan
triggerThreshold: 0
suppressionEnabled: false
kind: Scheduled
